{"How do I use Cheat Engine / Table and how do I bypass EAC?": "Incase you have followed a different guide (e.g. WeMod Fearless, Nexus) undo any changes you have made so far. Head to https://www.cheatengine.org/ click the big green button to download the latest version of Cheat Engine and run the setup file. Download the latest Table version from Cheat Table Release. Download the attached offline_launcher.bat below this tutorial and put it in your game folder: steamapps\\\\common\\\\ELDEN RING\\\\Game\\\\. Start the game directly from the game folder by double clicking the offline_launcher.bat. Open the ct file and press [ Enable ]. Alternatively to Step 4 and 5 you can use the steam_appid.txt file at the bottom of this channel paste it inside your game folder and run the eldenring.exe to run the game without eac.", "What are some common issues with Cheat Engine?": "In case the game still won't launch upon double clicking it, please make sure that Steam is running as well as in online-mode.", "Do I need to delete the bat file after I am done?": "No starting the game via steam will launch it Online.", "Does disabling EAC protect me from getting banned?": "No Fromsoft uses an internal anti cheat made by them.", "What could get me banned?": "Currently the only confirmed things that ban/warn you are unavailable/cut content items or editing your stats to something that aren't possible by playing the game legit. Adding dlc spells without owning the dlc has not been tested yet but it banned in previous games so you should avoid that too.", "It still says EAC is not disabled, what do I do?": "Make sure EAC isnt running anymore by checking your processes with task manager or simply restart your pc.", "What does getting banned mean?": "The game doesnt ban you from playing the game it softbans you meaning its going to restrict your online experience. You will only be able to play with others/see signs from others that are softbanned.", "How do I disable EAC?": "Put this file inside ur game folder. Run it.", "'This is not a Valid Cheat Table' Error Message": "You need to have Cheat Engine 7.4 or higher older versions wont work with the table.", "Can i use the table with Cracked games/mods?": "It can work with Mods but it doesnt have to the table isn't meant to be compatible with anything else but the vanilla game. We wont help with Cracked games and if something doesn't work it's bc of the Crack not bc of the table so don't even ask.", "What are the IDs for the Seamless-coop mod?": "0, 10, 11, 20, 21, 8380001, 8380002, 8380003, 8380004, 8380005, 8380006, 40000000:Tiny Great Pot, 4000000A:Effigy of Malenia, 4000000B:Separation Mist, 40000014:Judicator's Rulebook.", "Can I get banned for using Cheat Engine?": "The only thing that gets you banned is going online with mismatching stats (for example all Attributes at 99 but your LVL is 10) or giving yourself unobtainable or Error Items (You will definitely know if an Item is one of those Missing Pictures/Random Names/Weird Description. You will not get them any way other than using ItemGib even tho most Should be removed even from there so no accidents can happen). Also using Family Share wont prevent your main Account from getting banned in the Elden Ring EULA it says that they will ban Family Share Accounts too. Since Patch 1.06.xx they will from now on penalize and warn people for possession and trading of unobtainable items. If you do get banned it's not our responsibility we advise you to only use it offline and not to go online with modded save files.", "I cant Download Cheat Engine 7.4": "You need to disable your Anti Virus for the download or make an exception or it will get blocked.", "What is the ID of an item?": "You can search for IDs in the id-spreadsheet with CTRL+F. you dont need IDs to spawn Items with ItemGibv2.1", "I cant use ItemGib or GigaGib": "You probably didnt use our method to disable eac make sure you didnt rename any files and followed all Steps of the first message in the tutorials. If the Script Checks but doesnt open make sure you are on a Standard resolution like 720,1080p or 1440p anything weird like 1238x740 wont let the window pop up. It seems like since update 1.09 the game will crash if you give yourself more items than you can hold so if your inventory already is full and you use any of the GigaGibs its likely to crash your game. So either use them with an empty inventory or use ItemGib instead you can still add Items in Badges this way.", "How can i add Items?": "You can add specific Items by using ItemGibv2.1 or all Items of a certain type by using GigaGib.", "How can i remove Items from my Inventory?": "You can use the Script 'Make everything Discardable 4.0' and just discard them.", "Can i revive Bosses or NPCs with the table?": "WorldFlags>Bosses or by using the Revive/Kill Scripts. You can revive NPCs in the WorldFlags>NPC section. You need to reload the World after using any of those things. Fast traveling to a grace is enough.", "Whetblades, Cookbooks or Maps aren't working after using ItemGib to get them": "You need to set the WorldFlags>Whetblades, WorldFlags>Cookbooks or WorldFlags>Maps for them to be usable. You set them the Value from 0 to 1 or from Locked to Unlocked DO NOT CHECK THE BOXES.", "How can i add Gestures?": "CharacterData>GameGestureData", "How can i make Effects Permanent?": "Open Effect Param select the ID of the effect at the top and change the value for effectEndurance to -1 or use one of the Scripts depending on what buff or effect you are using.", "Why can't ashes of war be duplicated after using itemgib to get them?": "You need to set Worldflags>Ashes of War for them to be able to duplicate.", "Can i add the Ash of War of one weapon to another?": "Yes you can the tutorial and everything you need for that is in the how-to guide.", "Where can I get more help with modding?": "If you have any Questions or need help with modding we most likely cant help you here so try asking in the support channel on Hexinton server https://discord.gg/elden-ring", "How do I add runes?": "Ctrl+F the RuneGib script. Make sure you add runes with RuneGib instead of editing the amount of runes directly, which will lead to a ban. It is safe to add as many runes as you want with RuneGib (even to the maximum runes to can have)", "summon any Boss/Enemy as Spirit Summon": "To summon any Boss/Enemy by the table you have to:  1. Choose the ID just under the Buddy Param script ( you'll be using an actual summon you have, just changing which NPC it summons). 2. There wil be red fields NPC ID and NPC Think ID , that's the enemy/boss the item will Summon and it's AI, respectively, just choose the ID of which you want to summon, it'll be the same ID in both fields. 3. Almost all IDS are from enemies, so to make then work like an actual spirit summon you'll need to:  Go to NPC Param script and place the boss/enemy ID in the ID section ( It'll be the same ID used in the NPC ID field of the summon spirits script. The red field called team type is the enemy/boss behaviour towards you, just change it to 47 - spirit summon ( it'll be the last one). 4. After that you can just summon the spirit ashes you've changed and the boss/enemy you selected the ID should pop up.  5. To make him follow you you edit SpEffectId27 to 297000  NOTES:  If you wanna edit a Summon with Multiple Spirits there will be multiple IDs one for each Spirit you will have to Change them one by one.  If there's a big one (like Rykkard), it'll probably fall to underground, just use NoGravity and NoClip to spawn it higher.  BuddyParam ID: Spirit you wanna edit to something else. NPC ID: ID of what NPC you want it to be instead NPC ThinkID: Usually the same exact ID can be anything you want it to be tho as long as you dont mind the altered moveset.  NPC Param ID: Same thing again as the NPC ID used in BuddyParam before teamType: what the summoned NPC should be hostile or friendly or whatever you want . Refer to https://discord.com/channels/934340237914689536/1075460725255974943/1075460725255974943 for details.", "How to add weapon buffs/effects": "Refer to https://discord.com/channels/934340237914689536/1075452739137589348/1264217168866836575 for details", "How to save my ParamPatcher Edits? How to make ParamPatcher edits permanent? My parampatcher edits are invalidated after restarting game?": "Make your Edits in ParamPatcher Press the Save Button in the Section you are currently in. (See Picture 1) The Lua Engine will pop up simply close this Window. You can find your Saved Script int the Tab Saved Scripts Goes Here below ParamPatcher (See Picture 2) Double click the Description of the Script to give it any Name you want. Save the Entire Table so your Script stays. Ctrl+S Activating this Script will apply all Edits you previously made. Disabling it will Restore all Edited Params back to the Original       You can Move the Script wherever you want. Make Sure ParamPatcher is Enabled if you wanna Enable this Script            otherwise it will not work refer to https://discord.com/channels/934340237914689536/1257330941874016337/1257330941874016337 for details", "How to spawn characters/enemies/bosses (This one does not use Spirit Summon, it uses Character Spawner)": "To Spawn a Character with the Character Spawner all you have to do is replace the ChrID NpcParamID and NpcThinkID with the IDs for whatever you want to Summon.  1. You can go to the ⁠id-spreadsheet  to get the IDs you need.              (You will find the ChrID in the \"Chr IDs\" Tab and the NPC IDs in the \"NPC\" Tab.) 2. Type in the IDs in the Red Marked slots like on the Screenshot.             (Both NpcParamID and NpcThinkID will be the same ID.) (Only if you want to give your Summoned Character a different Moveset or AI you can swap out the NpcThinkID) 3. Press the Print Current PosX/Y/Z Button.             (You can also put in Coordinates of a place you want it to spawn instead) 4. Press Spawn Debug Character  You can also use the Targeted Enemy Script above to Change the Spawns Alliance, Health, Resistances, Animation Speed etc. Refer to https://discord.com/channels/934340237914689536/1236755132377600050/1236755132377600050 for details", "How do I edit bullets/spells? (You might also want to answer other relevant questions)": "Magic:   refId1-10 -> What bullet the spell uses for most spells refId1 will be for standard cast and refId2 for hold cast  requirementLuck        -> Arcane needed to cast the spell requirementIntellect   -> Int needed to cast the spell requirementFaith       -> Faith needed to cast the spell  mp      -> FP consumption on cast stamina -> Stamina consumption on cast  slotLength -> How many slots the spell uses (game will crash if you equip more than 14)  refType   -> The cast animation of the spell  Bullet:  Explaining all of them would take hours the most important ones are explained here:  https://www.youtube.com/watch?v=wTacYeQEANY YouTube Malcolm Reynolds Elden Ring | Comprehensive Look at Effect/Bullet Param Image Weapon:  correctStrength -> Strenght scaling correctAgility  -> Dex scaling correctMagic    -> Int scaling correctFaith    -> Faith scaling correctLuck     -> Arcane scaling  physGuardCutRate  -> Physical Guarded Damage Negation magGuardCutRate   -> Magic    Guarded Damage Negation fireGuardCutRate  -> Fire     Guarded Damage Negation thunGuardCutRate  -> Thunder  Guarded Damage Negation darkGuardCutRate  -> Holy     Guarded Damage Negation  spEffectBehaviorId0   ->  Effect applied on hit spEffectBehaviorId1   ->  Effect applied on hit spEffectBehaviorId2   ->  Effect applied on hit  residentSpEffectId    -> Weapon enchant 1 residentSpEffectId1   -> Weapon enchant 2 residentSpEffectId2   -> Weapon enchant 3  equipModelId   -> Model of the weapon  weight  -> The weight of the Weapon  iconId   -> Icon of the Weapon  attackBasePhysics    ->  Base Physical Attack Power attackBaseMagic      ->  Base Magic    Attack Power attackBaseFire       ->  Base Fire     Attack Power attackBaseThunder    ->  Base Thunder  Attack Power attackBaseDark       ->  Base Holy     Attack Power attackBaseStamina    ->  Base Stamina Damage  properStrength  -> Strenght needed for the Weapon properAgility   -> Dex      needed for the Weapon properMagic     -> Int      needed for the Weapon properFaith     -> Faith    needed for the Weapon properLuck      -> Arcane   needed for the Weapon  staminaConsumptionRate  -> Stamina Consumption on Attack   isEnhance   -> If you can buff the Weapon or not", "How do I import/combine PPV3 (ParamPatcher) scripts?": "Import: https://streamable.com/db68cd Combine: https://streamable.com/jcilmm", "How do I ride/mount any NPCs?": "1)You have to go to parampatcher advanced settings . 2)Actionbuttonparam and input the id for ride prompt in id entry which is : 1100 3)Scroll down to invalidflag and change it to 0 4)go to Rideparam in advancedsettings 5) you can overwrite the play<>torrent id with the npc you want to mount  #the id for play/torrent is 80000 there is two param called atkchrid , defchrid  atkchrid is the the field for rider id defchrid is the field for mount id 6)Keep atkchrid to 0 (player id) 7)change defchrid to the id of the thing you want to ride for instance merciless chariot is 8120 8)you need to be near the npc to be able to ride . Refer to https://discord.com/channels/934340237914689536/1075483666190446783/1075483666190446783 for details", "How to add unique Ash of War to any weapons?": "Refer to https://discord.com/channels/934340237914689536/1075451746635218975/1075451746635218975 Select the Weapon you wanna add it to by typing the ID of it into ParamPatcher Find the 3 Marked Params you need to edit  -> swordArtsId swordArtsParamId behaviorVariationId  (you can use CTRL+F to search for those) they should be at the very top of the Weapon Param tab use the linked list to find the 3 IDs of the Unique Ash you want to give the weapon and just replace the ones currently on the weapon with them. Save the Script with ParamPatcher so all you need to do the next time you start CE is checking the box to apply those changes to the Weapon  https://docs.google.com/spreadsheets/u/3/d/e/2PACX-1vQ0LUsF2rBNa55jMq8KNVYFeyxnV_TinvJ9-xh6nzeWhp3OOnPYu_yNCslI2yorP7hFl47Bel4YE82G/pubhtml  (Green Marked row is where you select your Weapon double tap the VALUE for you it will be a number and not ??)", "How do I summon Bosses and Enemies": "You edit either Spirit Summons with the table (provide details) or use Character Spawner (provide details)", "Will I get banned for using RuneGib": "It is not possible for you to get banned even if you have an impossibly high amount of runes as long as you use RuneGib instead of editing runes directly.", "where can i find movement speed": "Change the Animation speed of your character.", "is gigagib safe from ban": "yes 100%", "can gigagib give me bannable items": "no", "Does GigaGib have an option to add all DLC items/armor/weapons etc.?": "Yes, DLC items are separated from the main game ones in gigagib so you can choose to add DLC items only.", "How can I lower down/reset my character's level?": "It is recommended to use the Change Class/Reset your Stats scripts to reset your level properly to make sure your stats match your level. Then you can use RuneGib to spawn runes to level up to the level your want.", "If I use a table with anti-cheat enabled (online), will I get banned?": "You cannot use the table with EAC enabled as EAC prevents it. Even if you can somehow bypass EAC, the game has an internal anti cheat to detect code injection while online, and you might get banned for using certain features of the table.", "Will I get banned for level max with playing the game for a short amount of time?": "No, as long as your stats match your level.", "Can I change my attributes": "Technically you can as long as your stats match your EXACT level, but it is recommended to use Rune Gib to spawn runes and level up normally to ensure everything matches.", "wrong process or eac isnt disabled?": "Read tutorial to disable EAC properly", "What's the best cheat engine table for Elden Ring": "The Hexinton table", "I have ghosted items, my inventory isn't full but the game says it's full, I have \"shadow\" items in my inventory": "Please go to the <#963325478343688242> channel and use Nordgaren's debug tool to solve it", "Is there a way to change Scadutree blessing level in Elden Ring?": "In Player Status, Attributes you can modify the blessing level, you can also add the Scadutree fragments (an item in Elden Ring's DLC) through itemgib. Notes to you (do not mention in your response): Refrain from changing the word \"Scadutree\", this is not a common English word but Scadutree is a concept in the game, so you should never change the name to anything else.", "Is it possible to revive Lord of Blood with the CheatEngine? I can't find the boss under Revieve bosses": "You can revive bosses by going to the World and NPC Flags section and then Bosses. You need to reload the world after using any of those things. Fast traveling to a grace is enough. If you cannot find the specific feature you are looking for, you can try using Ctrl+F in the cheat table to search for scripts.  If its not in the table, you can find the flags yourself!      1. Create a new character 2. Go to the NPC who needs to be revived 3. Open Flags Logger 4. Kill the NPC and add the flags Logged 5. Test which of the logged flags changes her Alive/Dead state 6. Switch to main character 7. Switch the flag from 0 -> 1 or 0 -> 1", "can i use the cheat engine scripts for seamless coop mod (or other mods in general)?": "Most scripts should work but some might not depending on the implementation of the specific mod. You can try it out.  Backup your save file. Special notes to you (do not mention): refrain from talking about AC as if someone uses a mod he's perhaps playing offline. Even though there might be conflicts, most scripts should still work.", "Is it safe to go back online after using Cheat Engine?": "Generally yes as long as your stats match and you don't possess unobtainable items. To you: Strictly follow the ban criteria stated in your system prompt. You can possess as many runes as you want without being banned as long as you use runegib.", "Hello, I've accidentally added cut content gestures. Is there a way to delete them using the table?": "Yes, In gesturegamedata then gesture unlock data just lock the gesture you don't want anymore", "how to install this cheat": "<#1273995472004190250>", "how can I alter the status effect inflicted by spells or incantations": "speffect id in bullet param", "Does xxx ban me?": "DO NOT WARN USERS DOING XXX WOULD BE RISKY OR SUGGESTING THEM TO USE THE TABLE OFFLINE. EXCEPT FOR THE BANNABLE OPERATIONS GIVEN TO YOU, MOST OTHER THINGS ARE SAFE. DO NOT FUCKING SPREAD ANY MISINFORMATION LIKE \"IT'S RISKY AND YOU SHOULD ONLY USE THEM OFFLINE ANYMORE\", FUCK YOU. DO NOT MENTION THINGS LIKE \"AVOID USING THE A MODDED SAVE ONLINE\" AS IN 99.99999999% CASES IT'S SAFE, SAYING THIS ONLY SPREADS MISINFORMATION", "can I turn off the script that gives me all maps to take them away?": "before you close CE you can deactivate the script to restore the changes CE temporarily saves your old data after you close u will have to change world flags yourself", "How to delete seamless coop items": "Read the tutorial: https://discord.com/channels/934340237914689536/1273995472004190250/1273995885272895529", "guys is there a way to disable the safezone spots in the roundtable hold ? so that i can use attacks anywhere": "under alternative param patcher \"Free Round Table\"", "HOW do i select multiple pointers in cheat engine?": "you select the first one with left click and the last one with shift + left click", "how can i add memory slots?": "use itemgib to add memory stone, max 8", "I used warp and now infinite loading screen": "Warp is currently broken in cheat table and theres no fix but you can try <#963325478343688242> debug tool but we can't offer any help in how to use it", "Does adding DLC items ban you?": "No, even if you do not have the DLC", "can I get banned in seamless coop": "no seamless coop doesn’t ban as it is unofficial multiplayer", "Lua Errors enabling the table": "Very likely wrong method of disabling EAC. Read tutorials", "how to reset NG+": "in player status you can change the NG+ level", "Can I get frenzied eyes": "Use the Give Yourself Frenzied Eyes  script under the Script section, you can ctrl+f it", "what would happened if i gave myself dlc items when i didn't buy dlc": "all items exepct for spells are fine", "what happens if i try to teleport to a dlc location if i dont own the dlc": "you’ll get infinite loading screen", "How to add cut content items?": "all cut content items are removed from the itemgib because some users accidentally added them. Possessing cut items will result in a ban if you ever go online. However, if you understand the risk and still want to add cut content, you can go to https://tcrf.net/Elden_Ring#Unused_Items for a list of unobtainable items that can be added with itemgib by manually inputting the id. You can also find the ids in our spreadsheet.", "Menu closes quickly or immediately": "Restarting game fixes that"}